//基本概念

/**
 * 
 * 本质上就是一种匹配模式 那么左边的变量就可以被赋予对应的只
 * 
 * 解构赋值主要分为：
 * 1 数组的解构赋值
 * 2 对象的解构赋值
 * 3 基本类型的解构赋值
 * 
 */

 //null 和 undefined 不能解构赋值

 //以前

//  let a = 1;
//  let b = 2;
//  let c = 3;

 //可以为如下

 //let [a,b,c] = [1,2,3];

// console.log(a,b,c);  //1 2 3
//---------------------------------------------------------------------------
 //1 数组的解构赋值

// let [a,[[b],c]] = [1,[[2],3]];
// console.log(a,b,c);


//let [ , , c] = [1,2,3];

//console.log(c); //3


// let [x] = [];

// console.log(x) ;  // let x ;undefined 


// let  [ y = 1] = [];

// console.log(y)  //1


 //---------------------------------------------------------------------------
 //2对象的解构赋值








  //---------------------------------------------------------------------------
 //3基本类型的解构赋值